ext_alsav/Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ХарактеристикиНоменклатуры</Name>
			<Owners>
				<xr:Item>Catalog.ВидыНоменклатуры</xr:Item>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ext_alsav/Catalogs/ХарактеристикиНоменклатуры/Ext/ObjectModule.bsl
&Перед("ПередЗаписью")
Процедура алсав_ПередЗаписью(Отказ)
	// Вставить содержимое метода. 
	
	лкСсылка = ЭтотОбъект.Ссылка;
	Если НЕ ЭтотОбъект.ЭтоГруппа Тогда
		
		Если ЭтотОбъект.ЭтоНовый() Тогда
			лкСсылка = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор);
			ЭтотОбъект.УстановитьСсылкуНового(лкСсылка);
		КонецЕсли;
		
		//гуид = алсав_ДопРеквизиты.ПолучитьДопРеквизит(ЭтотОбъект, "GUID");
		//Если НЕ ЗначениеЗаполнено(гуид) Тогда
			алсав_ДопРеквизиты.УстановитьЗначениеДопРеквизита(ЭтотОбъект, "GUID", ""+лкСсылка.УникальныйИдентификатор());
		//КонецЕсли;
		
		
		//гуид = алсав_ДопРеквизиты.ПолучитьДопРеквизит(ЭтотОбъект, "GUID Номенклатура и Характеристика");
		//Если НЕ ЗначениеЗаполнено(гуид) Тогда
			алсав_ДопРеквизиты.УстановитьЗначениеДопРеквизита(
				ЭтотОбъект,
				"GUID Номенклатура и Характеристика",
				""+ЭтотОбъект.Владелец.УникальныйИдентификатор()+"#"+ лкСсылка.УникальныйИдентификатор());
		//КонецЕсли;
		
	КонецЕсли;
	
	
	допАртикул = "";
	Попытка
		наименованиеДопРеквизита = "ИКТ";
		допАртикул = алсав_ДопРеквизиты.ПолучитьДопРеквизит(ЭтотОбъект, наименованиеДопРеквизита);		
		Если НЕ ЗначениеЗаполнено(ДопАртикул) Тогда 
			новыйАртикул = Справочники.ХарактеристикиНоменклатуры.ПолучитьНовыйАртикул(ЭтотОбъект);
			Если ЗначениеЗаполнено(новыйАртикул) Тогда
				алсав_ДопРеквизиты.УстановитьЗначениеДопРеквизита(ЭтотОбъект,наименованиеДопРеквизита,новыйАртикул);
			Конецесли;			
		конецЕсли; 		
	Исключение
	КонецПопытки;
	
	
	Если ЗначениеЗаполнено(допАртикул) Тогда			
		Запрос = новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	дсИКТ.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК дсИКТ
		               |ГДЕ
		               |	дсИКТ.Ссылка <> &Ссылка
		               |	И дсИКТ.Свойство.Заголовок = &Заголовок
		               |	И дсИКТ.Значение = &Значение";
		Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
		Запрос.УстановитьПараметр("Заголовок",наименованиеДопРеквизита);
		Запрос.УстановитьПараметр("Значение",допАртикул);
		
		рез = Запрос.Выполнить().Выбрать();
		Если рез.Следующий() Тогда
			Отказ = истина;
			ВызватьИсключение "ИКТ ["+допАртикул+"] уже назначен для ["+рез.Ссылка.Владелец+"].["+рез.Ссылка+"]";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
